; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p19---int100n150-m25---int100c200---s563---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 - fuellevel
)

(:init
(sum level0 level15 level15)
(sum level0 level16 level16)
(sum level0 level22 level22)
(sum level1 level15 level16)
(sum level1 level16 level17)
(sum level1 level22 level23)
(sum level2 level15 level17)
(sum level2 level16 level18)
(sum level2 level22 level24)
(sum level3 level15 level18)
(sum level3 level16 level19)
(sum level3 level22 level25)
(sum level4 level15 level19)
(sum level4 level16 level20)
(sum level4 level22 level26)
(sum level5 level15 level20)
(sum level5 level16 level21)
(sum level5 level22 level27)
(sum level6 level15 level21)
(sum level6 level16 level22)
(sum level6 level22 level28)
(sum level7 level15 level22)
(sum level7 level16 level23)
(sum level7 level22 level29)
(sum level8 level15 level23)
(sum level8 level16 level24)
(sum level8 level22 level30)
(sum level9 level15 level24)
(sum level9 level16 level25)
(sum level9 level22 level31)
(sum level10 level15 level25)
(sum level10 level16 level26)
(sum level10 level22 level32)
(sum level11 level15 level26)
(sum level11 level16 level27)
(sum level11 level22 level33)
(sum level12 level15 level27)
(sum level12 level16 level28)
(sum level12 level22 level34)
(sum level13 level15 level28)
(sum level13 level16 level29)
(sum level13 level22 level35)
(sum level14 level15 level29)
(sum level14 level16 level30)
(sum level14 level22 level36)
(sum level15 level15 level30)
(sum level15 level16 level31)
(sum level15 level22 level37)
(sum level16 level15 level31)
(sum level16 level16 level32)
(sum level16 level22 level38)
(sum level17 level15 level32)
(sum level17 level16 level33)
(sum level17 level22 level39)
(sum level18 level15 level33)
(sum level18 level16 level34)
(sum level18 level22 level40)
(sum level19 level15 level34)
(sum level19 level16 level35)
(sum level19 level22 level41)
(sum level20 level15 level35)
(sum level20 level16 level36)
(sum level20 level22 level42)
(sum level21 level15 level36)
(sum level21 level16 level37)
(sum level21 level22 level43)
(sum level22 level15 level37)
(sum level22 level16 level38)
(sum level22 level22 level44)
(sum level23 level15 level38)
(sum level23 level16 level39)
(sum level23 level22 level45)
(sum level24 level15 level39)
(sum level24 level16 level40)
(sum level24 level22 level46)
(sum level25 level15 level40)
(sum level25 level16 level41)
(sum level25 level22 level47)
(sum level26 level15 level41)
(sum level26 level16 level42)
(sum level26 level22 level48)
(sum level27 level15 level42)
(sum level27 level16 level43)
(sum level27 level22 level49)
(sum level28 level15 level43)
(sum level28 level16 level44)
(sum level28 level22 level50)
(sum level29 level15 level44)
(sum level29 level16 level45)
(sum level29 level22 level51)
(sum level30 level15 level45)
(sum level30 level16 level46)
(sum level30 level22 level52)
(sum level31 level15 level46)
(sum level31 level16 level47)
(sum level31 level22 level53)
(sum level32 level15 level47)
(sum level32 level16 level48)
(sum level32 level22 level54)
(sum level33 level15 level48)
(sum level33 level16 level49)
(sum level33 level22 level55)
(sum level34 level15 level49)
(sum level34 level16 level50)
(sum level34 level22 level56)
(sum level35 level15 level50)
(sum level35 level16 level51)
(sum level35 level22 level57)
(sum level36 level15 level51)
(sum level36 level16 level52)
(sum level36 level22 level58)
(sum level37 level15 level52)
(sum level37 level16 level53)
(sum level37 level22 level59)
(sum level38 level15 level53)
(sum level38 level16 level54)
(sum level38 level22 level60)
(sum level39 level15 level54)
(sum level39 level16 level55)
(sum level39 level22 level61)
(sum level40 level15 level55)
(sum level40 level16 level56)
(sum level40 level22 level62)
(sum level41 level15 level56)
(sum level41 level16 level57)
(sum level41 level22 level63)
(sum level42 level15 level57)
(sum level42 level16 level58)
(sum level42 level22 level64)
(sum level43 level15 level58)
(sum level43 level16 level59)
(sum level43 level22 level65)
(sum level44 level15 level59)
(sum level44 level16 level60)
(sum level44 level22 level66)
(sum level45 level15 level60)
(sum level45 level16 level61)
(sum level45 level22 level67)
(sum level46 level15 level61)
(sum level46 level16 level62)
(sum level46 level22 level68)
(sum level47 level15 level62)
(sum level47 level16 level63)
(sum level47 level22 level69)
(sum level48 level15 level63)
(sum level48 level16 level64)
(sum level48 level22 level70)
(sum level49 level15 level64)
(sum level49 level16 level65)
(sum level49 level22 level71)
(sum level50 level15 level65)
(sum level50 level16 level66)
(sum level50 level22 level72)
(sum level51 level15 level66)
(sum level51 level16 level67)
(sum level51 level22 level73)
(sum level52 level15 level67)
(sum level52 level16 level68)
(sum level52 level22 level74)
(sum level53 level15 level68)
(sum level53 level16 level69)
(sum level53 level22 level75)
(sum level54 level15 level69)
(sum level54 level16 level70)
(sum level54 level22 level76)
(sum level55 level15 level70)
(sum level55 level16 level71)
(sum level55 level22 level77)
(sum level56 level15 level71)
(sum level56 level16 level72)
(sum level56 level22 level78)
(sum level57 level15 level72)
(sum level57 level16 level73)
(sum level57 level22 level79)
(sum level58 level15 level73)
(sum level58 level16 level74)
(sum level58 level22 level80)
(sum level59 level15 level74)
(sum level59 level16 level75)
(sum level59 level22 level81)
(sum level60 level15 level75)
(sum level60 level16 level76)
(sum level60 level22 level82)
(sum level61 level15 level76)
(sum level61 level16 level77)
(sum level61 level22 level83)
(sum level62 level15 level77)
(sum level62 level16 level78)
(sum level62 level22 level84)
(sum level63 level15 level78)
(sum level63 level16 level79)
(sum level63 level22 level85)
(sum level64 level15 level79)
(sum level64 level16 level80)
(sum level64 level22 level86)
(sum level65 level15 level80)
(sum level65 level16 level81)
(sum level65 level22 level87)
(sum level66 level15 level81)
(sum level66 level16 level82)
(sum level66 level22 level88)
(sum level67 level15 level82)
(sum level67 level16 level83)
(sum level67 level22 level89)
(sum level68 level15 level83)
(sum level68 level16 level84)
(sum level68 level22 level90)
(sum level69 level15 level84)
(sum level69 level16 level85)
(sum level69 level22 level91)
(sum level70 level15 level85)
(sum level70 level16 level86)
(sum level70 level22 level92)
(sum level71 level15 level86)
(sum level71 level16 level87)
(sum level71 level22 level93)
(sum level72 level15 level87)
(sum level72 level16 level88)
(sum level72 level22 level94)
(sum level73 level15 level88)
(sum level73 level16 level89)
(sum level73 level22 level95)
(sum level74 level15 level89)
(sum level74 level16 level90)
(sum level74 level22 level96)
(sum level75 level15 level90)
(sum level75 level16 level91)
(sum level75 level22 level97)
(sum level76 level15 level91)
(sum level76 level16 level92)
(sum level76 level22 level98)
(sum level77 level15 level92)
(sum level77 level16 level93)
(sum level77 level22 level99)
(sum level78 level15 level93)
(sum level78 level16 level94)
(sum level78 level22 level100)
(sum level79 level15 level94)
(sum level79 level16 level95)
(sum level79 level22 level101)
(sum level80 level15 level95)
(sum level80 level16 level96)
(sum level80 level22 level102)
(sum level81 level15 level96)
(sum level81 level16 level97)
(sum level81 level22 level103)
(sum level82 level15 level97)
(sum level82 level16 level98)
(sum level82 level22 level104)
(sum level83 level15 level98)
(sum level83 level16 level99)
(sum level83 level22 level105)
(sum level84 level15 level99)
(sum level84 level16 level100)
(sum level84 level22 level106)
(sum level85 level15 level100)
(sum level85 level16 level101)
(sum level85 level22 level107)
(sum level86 level15 level101)
(sum level86 level16 level102)
(sum level86 level22 level108)
(sum level87 level15 level102)
(sum level87 level16 level103)
(sum level87 level22 level109)
(sum level88 level15 level103)
(sum level88 level16 level104)
(sum level88 level22 level110)
(sum level89 level15 level104)
(sum level89 level16 level105)
(sum level89 level22 level111)
(sum level90 level15 level105)
(sum level90 level16 level106)
(sum level90 level22 level112)
(sum level91 level15 level106)
(sum level91 level16 level107)
(sum level91 level22 level113)
(sum level92 level15 level107)
(sum level92 level16 level108)
(sum level92 level22 level114)
(sum level93 level15 level108)
(sum level93 level16 level109)
(sum level93 level22 level115)
(sum level94 level15 level109)
(sum level94 level16 level110)
(sum level94 level22 level116)
(sum level95 level15 level110)
(sum level95 level16 level111)
(sum level95 level22 level117)
(sum level96 level15 level111)
(sum level96 level16 level112)
(sum level96 level22 level118)
(sum level97 level15 level112)
(sum level97 level16 level113)
(sum level97 level22 level119)
(sum level98 level15 level113)
(sum level98 level16 level114)
(sum level98 level22 level120)
(sum level99 level15 level114)
(sum level99 level16 level115)
(sum level99 level22 level121)
(sum level100 level15 level115)
(sum level100 level16 level116)
(sum level100 level22 level122)
(sum level101 level15 level116)
(sum level101 level16 level117)
(sum level101 level22 level123)
(sum level102 level15 level117)
(sum level102 level16 level118)
(sum level102 level22 level124)
(sum level103 level15 level118)
(sum level103 level16 level119)
(sum level103 level22 level125)
(sum level104 level15 level119)
(sum level104 level16 level120)
(sum level104 level22 level126)
(sum level105 level15 level120)
(sum level105 level16 level121)
(sum level105 level22 level127)
(sum level106 level15 level121)
(sum level106 level16 level122)
(sum level106 level22 level128)
(sum level107 level15 level122)
(sum level107 level16 level123)
(sum level107 level22 level129)
(sum level108 level15 level123)
(sum level108 level16 level124)
(sum level108 level22 level130)
(sum level109 level15 level124)
(sum level109 level16 level125)
(sum level109 level22 level131)
(sum level110 level15 level125)
(sum level110 level16 level126)
(sum level110 level22 level132)
(sum level111 level15 level126)
(sum level111 level16 level127)
(sum level111 level22 level133)
(sum level112 level15 level127)
(sum level112 level16 level128)
(sum level112 level22 level134)
(sum level113 level15 level128)
(sum level113 level16 level129)
(sum level113 level22 level135)
(sum level114 level15 level129)
(sum level114 level16 level130)
(sum level114 level22 level136)
(sum level115 level15 level130)
(sum level115 level16 level131)
(sum level116 level15 level131)
(sum level116 level16 level132)
(sum level117 level15 level132)
(sum level117 level16 level133)
(sum level118 level15 level133)
(sum level118 level16 level134)
(sum level119 level15 level134)
(sum level119 level16 level135)
(sum level120 level15 level135)
(sum level120 level16 level136)
(sum level121 level15 level136)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l2)
(fuelcost level22 l0 l2)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l2)
(fuelcost level15 l1 l2)
(connected l2 l0)
(fuelcost level22 l2 l0)
(connected l2 l1)
(fuelcost level15 l2 l1)

(at t0 l1)
(fuel t0 level136)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l2)
(at p5 l1)
(at p6 l2)
(at p7 l1)
(at p8 l1)
(at p9 l0)
(at p10 l1)
(at p11 l0)
(at p12 l1)
(at p13 l1)
(at p14 l2)
(at p15 l1)
(at p16 l2)
(at p17 l1)
(at p18 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l0)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l0)
(at p8 l0)
(at p9 l1)
(at p10 l2)
(at p11 l2)
(at p12 l0)
(at p13 l2)
(at p14 l0)
(at p15 l0)
(at p16 l0)
(at p17 l0)
(at p18 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 0 of 19
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 19
3. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 19
4. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 19
5. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 19
6. (load p17 t0 l1)
   deleted: (at p17 l1)
   added: (in p17 t0)
   goals met: 0 of 19
7. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 0 of 19
8. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 0 of 19
9. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 19
10. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 19
11. (drive t0 l1 l2 level121 level15 level136)
   deleted: (at t0 l1) (fuel t0 level136)
   added: (at t0 l2) (fuel t0 level121)
   goals met: 0 of 19
12. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 19
13. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 19
14. (load p16 t0 l2)
   deleted: (at p16 l2)
   added: (in p16 t0)
   goals met: 0 of 19
15. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 0 of 19
16. (drive t0 l2 l0 level99 level22 level121)
   deleted: (at t0 l2) (fuel t0 level121)
   added: (at t0 l0) (fuel t0 level99)
   goals met: 0 of 19
17. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 1 of 19
18. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 2 of 19
19. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 3 of 19
20. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 4 of 19
21. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 5 of 19
22. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 6 of 19
23. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 7 of 19
24. (unload p17 t0 l0)
   deleted: (in p17 t0)
   added: (at p17 l0)
   goals met: 8 of 19
25. (unload p16 t0 l0)
   deleted: (in p16 t0)
   added: (at p16 l0)
   goals met: 9 of 19
26. (unload p15 t0 l0)
   deleted: (in p15 t0)
   added: (at p15 l0)
   goals met: 10 of 19
27. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 11 of 19
28. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 12 of 19
29. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 12 of 19
30. (load p18 t0 l0)
   deleted: (at p18 l0)
   added: (in p18 t0)
   goals met: 12 of 19
31. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 12 of 19
32. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 12 of 19
33. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 12 of 19
34. (drive t0 l0 l1 level83 level16 level99)
   deleted: (at t0 l0) (fuel t0 level99)
   added: (at t0 l1) (fuel t0 level83)
   goals met: 12 of 19
35. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 13 of 19
36. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 14 of 19
37. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 15 of 19
38. (drive t0 l1 l2 level68 level15 level83)
   deleted: (at t0 l1) (fuel t0 level83)
   added: (at t0 l2) (fuel t0 level68)
   goals met: 15 of 19
39. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 16 of 19
40. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 17 of 19
41. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 18 of 19
42. (unload p18 t0 l2)
   deleted: (in p18 t0)
   added: (at p18 l2)
   goals met: 19 of 19
